{"backend": "tensorflow", "keras_version": "2.0.4", "class_name": "Model", "config": {"input_layers": [["input_11", 0, 0], ["input_12", 0, 0]], "name": "model_6", "output_layers": [["dense_18", 0, 0]], "layers": [{"name": "input_11", "class_name": "InputLayer", "inbound_nodes": [], "config": {"dtype": "float32", "batch_input_shape": [null, 36, 60, 1], "name": "input_11", "sparse": false}}, {"name": "input_12", "class_name": "InputLayer", "inbound_nodes": [], "config": {"dtype": "float32", "batch_input_shape": [null, 36, 60, 1], "name": "input_12", "sparse": false}}, {"name": "conv2d_41", "class_name": "Conv2D", "inbound_nodes": [[["input_11", 0, 0, {}]]], "config": {"bias_constraint": null, "strides": [1, 1], "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "activation": "linear", "kernel_regularizer": null, "padding": "same", "trainable": true, "data_format": "channels_last", "use_bias": true, "filters": 20, "name": "conv2d_41", "bias_regularizer": null, "activity_regularizer": null, "kernel_size": [3, 3], "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"name": "conv2d_45", "class_name": "Conv2D", "inbound_nodes": [[["input_12", 0, 0, {}]]], "config": {"bias_constraint": null, "strides": [1, 1], "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "activation": "linear", "kernel_regularizer": null, "padding": "same", "trainable": true, "data_format": "channels_last", "use_bias": true, "filters": 20, "name": "conv2d_45", "bias_regularizer": null, "activity_regularizer": null, "kernel_size": [3, 3], "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"name": "leaky_re_lu_56", "class_name": "LeakyReLU", "inbound_nodes": [[["conv2d_41", 0, 0, {}]]], "config": {"trainable": true, "alpha": 0.009999999776482582, "name": "leaky_re_lu_56"}}, {"name": "leaky_re_lu_60", "class_name": "LeakyReLU", "inbound_nodes": [[["conv2d_45", 0, 0, {}]]], "config": {"trainable": true, "alpha": 0.009999999776482582, "name": "leaky_re_lu_60"}}, {"name": "conv2d_42", "class_name": "Conv2D", "inbound_nodes": [[["leaky_re_lu_56", 0, 0, {}]]], "config": {"bias_constraint": null, "strides": [1, 1], "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "activation": "linear", "kernel_regularizer": null, "padding": "same", "trainable": true, "data_format": "channels_last", "use_bias": true, "filters": 20, "name": "conv2d_42", "bias_regularizer": null, "activity_regularizer": null, "kernel_size": [3, 3], "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"name": "conv2d_46", "class_name": "Conv2D", "inbound_nodes": [[["leaky_re_lu_60", 0, 0, {}]]], "config": {"bias_constraint": null, "strides": [1, 1], "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "activation": "linear", "kernel_regularizer": null, "padding": "same", "trainable": true, "data_format": "channels_last", "use_bias": true, "filters": 20, "name": "conv2d_46", "bias_regularizer": null, "activity_regularizer": null, "kernel_size": [3, 3], "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"name": "max_pooling2d_21", "class_name": "MaxPooling2D", "inbound_nodes": [[["conv2d_42", 0, 0, {}]]], "config": {"strides": [2, 2], "name": "max_pooling2d_21", "pool_size": [2, 2], "padding": "valid", "trainable": true, "data_format": "channels_last"}}, {"name": "max_pooling2d_23", "class_name": "MaxPooling2D", "inbound_nodes": [[["conv2d_46", 0, 0, {}]]], "config": {"strides": [2, 2], "name": "max_pooling2d_23", "pool_size": [2, 2], "padding": "valid", "trainable": true, "data_format": "channels_last"}}, {"name": "dropout_36", "class_name": "Dropout", "inbound_nodes": [[["max_pooling2d_21", 0, 0, {}]]], "config": {"trainable": true, "name": "dropout_36", "rate": 0.5}}, {"name": "dropout_38", "class_name": "Dropout", "inbound_nodes": [[["max_pooling2d_23", 0, 0, {}]]], "config": {"trainable": true, "name": "dropout_38", "rate": 0.5}}, {"name": "conv2d_43", "class_name": "Conv2D", "inbound_nodes": [[["dropout_36", 0, 0, {}]]], "config": {"bias_constraint": null, "strides": [1, 1], "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "activation": "linear", "kernel_regularizer": null, "padding": "same", "trainable": true, "data_format": "channels_last", "use_bias": true, "filters": 50, "name": "conv2d_43", "bias_regularizer": null, "activity_regularizer": null, "kernel_size": [3, 3], "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"name": "conv2d_47", "class_name": "Conv2D", "inbound_nodes": [[["dropout_38", 0, 0, {}]]], "config": {"bias_constraint": null, "strides": [1, 1], "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "activation": "linear", "kernel_regularizer": null, "padding": "same", "trainable": true, "data_format": "channels_last", "use_bias": true, "filters": 50, "name": "conv2d_47", "bias_regularizer": null, "activity_regularizer": null, "kernel_size": [3, 3], "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"name": "leaky_re_lu_58", "class_name": "LeakyReLU", "inbound_nodes": [[["conv2d_43", 0, 0, {}]]], "config": {"trainable": true, "alpha": 0.009999999776482582, "name": "leaky_re_lu_58"}}, {"name": "leaky_re_lu_62", "class_name": "LeakyReLU", "inbound_nodes": [[["conv2d_47", 0, 0, {}]]], "config": {"trainable": true, "alpha": 0.009999999776482582, "name": "leaky_re_lu_62"}}, {"name": "conv2d_44", "class_name": "Conv2D", "inbound_nodes": [[["leaky_re_lu_58", 0, 0, {}]]], "config": {"bias_constraint": null, "strides": [1, 1], "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "activation": "linear", "kernel_regularizer": null, "padding": "same", "trainable": true, "data_format": "channels_last", "use_bias": true, "filters": 50, "name": "conv2d_44", "bias_regularizer": null, "activity_regularizer": null, "kernel_size": [3, 3], "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"name": "conv2d_48", "class_name": "Conv2D", "inbound_nodes": [[["leaky_re_lu_62", 0, 0, {}]]], "config": {"bias_constraint": null, "strides": [1, 1], "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "activation": "linear", "kernel_regularizer": null, "padding": "same", "trainable": true, "data_format": "channels_last", "use_bias": true, "filters": 50, "name": "conv2d_48", "bias_regularizer": null, "activity_regularizer": null, "kernel_size": [3, 3], "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"name": "max_pooling2d_22", "class_name": "MaxPooling2D", "inbound_nodes": [[["conv2d_44", 0, 0, {}]]], "config": {"strides": [2, 2], "name": "max_pooling2d_22", "pool_size": [2, 2], "padding": "valid", "trainable": true, "data_format": "channels_last"}}, {"name": "max_pooling2d_24", "class_name": "MaxPooling2D", "inbound_nodes": [[["conv2d_48", 0, 0, {}]]], "config": {"strides": [2, 2], "name": "max_pooling2d_24", "pool_size": [2, 2], "padding": "valid", "trainable": true, "data_format": "channels_last"}}, {"name": "dropout_37", "class_name": "Dropout", "inbound_nodes": [[["max_pooling2d_22", 0, 0, {}]]], "config": {"trainable": true, "name": "dropout_37", "rate": 0.5}}, {"name": "dropout_39", "class_name": "Dropout", "inbound_nodes": [[["max_pooling2d_24", 0, 0, {}]]], "config": {"trainable": true, "name": "dropout_39", "rate": 0.5}}, {"name": "flatten_11", "class_name": "Flatten", "inbound_nodes": [[["dropout_37", 0, 0, {}]]], "config": {"trainable": true, "name": "flatten_11"}}, {"name": "flatten_12", "class_name": "Flatten", "inbound_nodes": [[["dropout_39", 0, 0, {}]]], "config": {"trainable": true, "name": "flatten_12"}}, {"name": "dense_16", "class_name": "Dense", "inbound_nodes": [[["flatten_11", 0, 0, {}]]], "config": {"bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "activation": "linear", "kernel_regularizer": null, "use_bias": true, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_16", "bias_regularizer": null, "activity_regularizer": null, "units": 512, "kernel_constraint": null}}, {"name": "dense_17", "class_name": "Dense", "inbound_nodes": [[["flatten_12", 0, 0, {}]]], "config": {"bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "activation": "linear", "kernel_regularizer": null, "use_bias": true, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_17", "bias_regularizer": null, "activity_regularizer": null, "units": 512, "kernel_constraint": null}}, {"name": "concatenate_6", "class_name": "Concatenate", "inbound_nodes": [[["dense_16", 0, 0, {}], ["dense_17", 0, 0, {}]]], "config": {"trainable": true, "name": "concatenate_6", "axis": -1}}, {"name": "leaky_re_lu_64", "class_name": "LeakyReLU", "inbound_nodes": [[["concatenate_6", 0, 0, {}]]], "config": {"trainable": true, "alpha": 0.009999999776482582, "name": "leaky_re_lu_64"}}, {"name": "dropout_40", "class_name": "Dropout", "inbound_nodes": [[["leaky_re_lu_64", 0, 0, {}]]], "config": {"trainable": true, "name": "dropout_40", "rate": 0.5}}, {"name": "dense2_layer", "class_name": "Dense", "inbound_nodes": [[["dropout_40", 0, 0, {}]]], "config": {"bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "activation": "linear", "kernel_regularizer": null, "use_bias": true, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense2_layer", "bias_regularizer": null, "activity_regularizer": null, "units": 1024, "kernel_constraint": null}}, {"name": "leaky_re_lu_65", "class_name": "LeakyReLU", "inbound_nodes": [[["dense2_layer", 0, 0, {}]]], "config": {"trainable": true, "alpha": 0.009999999776482582, "name": "leaky_re_lu_65"}}, {"name": "dropout_41", "class_name": "Dropout", "inbound_nodes": [[["leaky_re_lu_65", 0, 0, {}]]], "config": {"trainable": true, "name": "dropout_41", "rate": 0.5}}, {"name": "dense3_layer", "class_name": "Dense", "inbound_nodes": [[["dropout_41", 0, 0, {}]]], "config": {"bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "activation": "linear", "kernel_regularizer": null, "use_bias": true, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense3_layer", "bias_regularizer": null, "activity_regularizer": null, "units": 1024, "kernel_constraint": null}}, {"name": "leaky_re_lu_66", "class_name": "LeakyReLU", "inbound_nodes": [[["dense3_layer", 0, 0, {}]]], "config": {"trainable": true, "alpha": 0.009999999776482582, "name": "leaky_re_lu_66"}}, {"name": "dropout_42", "class_name": "Dropout", "inbound_nodes": [[["leaky_re_lu_66", 0, 0, {}]]], "config": {"trainable": true, "name": "dropout_42", "rate": 0.5}}, {"name": "dense_18", "class_name": "Dense", "inbound_nodes": [[["dropout_42", 0, 0, {}]]], "config": {"bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "activation": "softmax", "kernel_regularizer": null, "use_bias": true, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_18", "bias_regularizer": null, "activity_regularizer": null, "units": 2, "kernel_constraint": null}}]}}